@simitt Good point. The `connection refused` part of the below log makes me think the host is not even up or something is blocking the request when we attempt to run these commands. 
```
timeout - last error: dial tcp 18.213.245.176:22: connect: connection refused
```
This `Provisioner` action is the first one for this resource, so that may explain why we see this specific action failing vs the other Provisioner actions for this resource. 

I reviewed the logs for all runs. The last run that failed with this specific `remote-exec` error occurred 2 weeks ago 🤷.   I complied some notes on the last successful run and the recent failed runs when the Smoke Test for OS (9.0) failed ( note: there are some other recent failed runs for other steps that I did not include). 

TL;DR 7 out of the last 25 Smoke Test have failed for a few different reasons. This specific issue for the `Provisioner` is intermittent. Not sure if we want to continue to focus on this one specifically or look into other options to improve the reliability of the entire Smoke Test workflow. 

### Latest Success
Run 587
https://github.com/elastic/apm-server/actions/runs/14920723221
```hcl
Adding tfvar aws_provisioner_key_name="provisioner_key_1746761108"
-> Adding tfvar aws_os="Rocky-8-EC2-Base"
-> Adding tfvar stack_version="9.0.2-SNAPSHOT"
-> Applying terraform configuration...
-> Removing all data from ES...
{"took":27,"timed_out":false,"total":22,"deleted":22,"batches":1,"version_conflicts":0,"noops":0,"retries":{"bulk":0,"search":0},"throttled_millis":0,"requests_per_second":-1.0,"throttled_until_millis":0,"failures":[]}-> APM Server ready!
```

@ericywl I think this shows the observed failures for Rocky-8-EC2-Base were most likely a coincidence. 

### Failed Runs for OS (9.0)
Note there other failed runs. This just list specific failures for Smoke Test OS (9.0)
1. Run 586 
- https://github.com/elastic/apm-server/actions/runs/14897918257/job/41843973616
```
-> Adding tfvar aws_provisioner_key_name="provisioner_key_1746674750"
-> Adding tfvar aws_os="OL9"
-> Adding tfvar stack_version="9.0.1-SNAPSHOT"
-> Applying terraform configuration...

Error: External Program Execution Failed

  with module.standalone_apm_server.data.external.latest_elastic_agent,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 285, in data "external" "latest_elastic_agent":
 285:   program = ["bash", "${path.module}/latest_elastic_agent.sh", "${var.stack_version}"]

The data source received an unexpected error while attempting to execute the
program.

Program: /usr/bin/bash
Error Message: jq: parse error: Invalid numeric literal at line 1, column 7

State: exit status 5

Error: External Program Execution Failed

  with module.standalone_apm_server.data.external.latest_apm_server,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 289, in data "external" "latest_apm_server":
 289:   program = ["bash", "${path.module}/latest_apm_server.sh", "${var.stack_version}"]

The data source received an unexpected error while attempting to execute the
program.

Program: /usr/bin/bash
Error Message: jq: parse error: Invalid numeric literal at line 1, column 7

State: exit status 5
-> Smoke tests FAILED!!
-> Printing terraform logs:
```

2. Run 580
- https://github.com/elastic/apm-server/actions/runs/14745992585/job/41409151280
```hcl
-> Running basic supported OS smoke test for version 9.1.0-SNAPSHOT
-> Adding tfvar aws_provisioner_key_name="provisioner_key_1746005180"
-> Adding tfvar aws_os="ubuntu-focal-20.04-arm64-server"
-> Adding tfvar stack_version="9.1.0-SNAPSHOT"
-> Applying terraform configuration...

Error: External Program Execution Failed

  with module.standalone_apm_server.data.external.latest_elastic_agent,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 285, in data "external" "latest_elastic_agent":
 285:   program = ["bash", "${path.module}/latest_elastic_agent.sh", "${var.stack_version}"]

The data source received an unexpected error while attempting to execute the
program.

Program: /usr/bin/bash
Error Message: jq: parse error: Invalid numeric literal at line 1, column 7

State: exit status 5

Error: External Program Execution Failed

  with module.standalone_apm_server.data.external.latest_apm_server,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 289, in data "external" "latest_apm_server":
 289:   program = ["bash", "${path.module}/latest_apm_server.sh", "${var.stack_version}"]

The data source received an unexpected error while attempting to execute the
program.

Program: /usr/bin/bash
Error Message: jq: parse error: Invalid numeric literal at line 1, column 7

State: exit status 5
-> Smoke tests FAILED!!
```

3. Run 579
- https://github.com/elastic/apm-server/actions/runs/14722634672/job/41323387824

```hcl
-> Applying terraform configuration...
-> Removing all data from ES...
{"took":28,"timed_out":false,"total":22,"deleted":22,"batches":1,"version_conflicts":0,"noops":0,"retries":{"bulk":0,"search":0},"throttled_millis":0,"requests_per_second":-1.0,"throttled_until_millis":0,"failures":[]}-> APM Server ready!
-> Sending events to APM Server...
-> Asserting ingest pipelines...
-> Asserting logs-apm.error-* contains expected documents...
-> Asserted 1 error.id=9876543210abcdeffedcba0123456789 exists
-> Asserting traces-apm-* contains expected documents...
-> Asserted 1 span.id=1234567890aaaade exists
-> Asserting traces-apm-* contains expected documents...
-> Asserted 1 transaction.id=4340a8e0df1906ecbfa9 exists
-> Asserting metrics-apm.internal-* contains expected documents...
-> Asserted 1 transaction.type=request exists
-> Adding tfvar aws_provisioner_key_name="provisioner_key_1745905393"
-> Adding tfvar aws_os="Rocky-8-EC2-Base"
-> Adding tfvar stack_version="9.0.1-SNAPSHOT"
-> Applying terraform configuration...

Error: remote-exec provisioner error

  with module.standalone_apm_server.aws_instance.apm,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 206, in resource "aws_instance" "apm":
 206:   provisioner "remote-exec" {

timeout - last error: dial tcp 3.236.188.218:22: connect: connection refused
-> Smoke tests FAILED!!
```

Adding terraform logs since this is the issue we are looking into. Please note: `instance_type = "t4g.nano"`. This should mean the first provisioner action should have been a no-op since we did not need to mount the ssd. 

```hcl
# module.standalone_apm_server.aws_instance.apm will be created
  + resource "aws_instance" "apm" {
      + ami                                  = "ami-05e1b549850b7e14f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d5df40a9318077f4"
      + tags                                 = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

```

4. Run 570
- https://github.com/elastic/apm-server/actions/runs/14483985492
```hcl
-> Adding tfvar aws_provisioner_key_name="provisioner_key_1744787832"
-> Adding tfvar aws_os="RHEL-9"
-> Adding tfvar stack_version="8.18.0-SNAPSHOT"
-> Applying terraform configuration...
-> Removing all data from ES...
{"took":30,"timed_out":false,"total":22,"deleted":22,"batches":1,"version_conflicts":0,"noops":0,"retries":{"bulk":0,"search":0},"throttled_millis":0,"requests_per_second":-1.0,"throttled_until_millis":0,"failures":[]}
-> APM Server isn't ready to receive events, retrying (1/10)...

-> APM Server isn't ready to receive events, retrying (2/10)...

-> APM Server isn't ready to receive events, retrying (3/10)...

-> APM Server isn't ready to receive events, retrying (4/10)...

-> APM Server isn't ready to receive events, retrying (5/10)...

-> APM Server isn't ready to receive events, retrying (6/10)...

-> APM Server isn't ready to receive events, retrying (7/10)...

-> APM Server isn't ready to receive events, retrying (8/10)...

-> APM Server isn't ready to receive events, retrying (9/10)...

-> APM Server isn't ready to receive events, maximum retries exceeded
-> Smoke tests FAILED!!
```

5. Run 552
- https://github.com/elastic/apm-server/actions/runs/13987979740/job/39165375976
```hcl
-> Adding tfvar aws_provisioner_key_name="provisioner_key_1742547086"
-> Adding tfvar aws_os="Rocky-8-EC2-Base"
-> Adding tfvar stack_version="9.0.0-SNAPSHOT"
-> Applying terraform configuration...

Error: remote-exec provisioner error

  with module.standalone_apm_server.aws_instance.apm,
  on ../../infra/terraform/modules/standalone_apm_server/main.tf line 206, in resource "aws_instance" "apm":
 206:   provisioner "remote-exec" {

timeout - last error: dial tcp 34.236.254.231:22: connect: connection refused
-> Smoke tests FAILED!!
```
Please note: `instance_type = "t4g.nano"`
```hcl
# module.standalone_apm_server.aws_instance.apm will be created
  + resource "aws_instance" "apm" {
      + ami                                  = "ami-0a0c7cd07b89f48bc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d5df40a9318077f4"
      + tags                                 = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }
```

In general 7 out of the past 25 Smoke test workflows have failed. I think we can potentially improve the reliability of creating the `"aws_instance" "apm"` resource with some of the options we discussed in my prior comment. Or since there a multiple intermittent errors, we can investigate the possibility of automatically re-running the entire workflow or a specific step if it fails (not sure if there are any cost/usage implications though). 
